Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Be sure you meet the following requirements:
it_it: Assicurarsi di soddisfare i seguenti requisiti:

source: Beaglebone image and SDK build testing
it_it: Test dell'immagine Beaglebone e della build SDK

source: Because blktrace traces block I/O and at the same time normally writes its trace data to a block device, and in general because it's not really a great idea to make the device being traced the same as the device the tracer writes to, blktrace provides a way to trace without perturbing the traced device at all by providing native support for sending all trace data over the network.
it_it: Poiché blktrace traccia le operazioni di I/O a blocchi e allo stesso tempo scrive normalmente i dati di tracciamento su un dispositivo a blocchi, e in generale poiché non è una buona idea utilizzare lo stesso dispositivo su cui il tracer scrive, blktrace offre un modo per tracciare senza alterare in alcun modo il dispositivo tracciato, fornendo supporto nativo per l'invio di tutti i dati di tracciamento tramite rete.

source: Because open source projects are open to the public, they have different licensing structures in place. License evolution for both Open Source and Free Software has an interesting history. If you are interested in this history, you can find basic information here:
it_it: Poiché i progetti open source sono aperti al pubblico, hanno diverse strutture di licenza. L'evoluzione delle licenze sia per l'open source che per il software libero ha una storia interessante. Se siete interessati a questa storia, potete trovare informazioni di base qui:

source: Because the BSP layer naming convention is well-established, it is advisable to follow it when creating layers. Technically speaking, a BSP layer name does not need to start with ``meta-``. However, various scripts and tools in the Yocto Project development environment assume this convention.
it_it: Poiché la convenzione di denominazione dei layer BSP è ben consolidata, è consigliabile seguirla durante la creazione dei layer. Tecnicamente parlando, il nome di un layer BSP non deve necessariamente iniziare con ``meta-``. Tuttavia, diversi script e strumenti nell'ambiente di sviluppo di Yocto Project presuppongono questa convenzione.

source: Because the security requirements and risks are different for every type of device, this section cannot provide a complete reference on securing your custom OS. It is strongly recommended that you also consult other sources of information on embedded Linux system hardening and on security.
it_it: Poiché i requisiti e i rischi per la sicurezza variano a seconda del tipo di dispositivo, questa sezione non può fornire un riferimento completo sulla protezione del proprio sistema operativo personalizzato. Si raccomanda vivamente di consultare anche altre fonti di informazione sulla protezione dei sistemi Linux embedded e sulla sicurezza in generale.

source: Because this manual presents information for many different topics, supplemental information is recommended for full comprehension. For additional introductory information on the Yocto Project, see the :yocto_home:`Yocto Project Website <>`. If you want to build an image with no knowledge of Yocto Project as a way of quickly testing it out, see the :doc:`/brief-yoctoprojectqs/index` document. For a comprehensive list of links and other documentation, see the ":ref:`Links and Related Documentation <resources-links-and-related-documentation>`" section in the Yocto Project Reference Manual.
it_it: Poiché questo manuale presenta informazioni su molti argomenti diversi, si consiglia di consultare materiale supplementare per una comprensione completa. Per ulteriori informazioni introduttive sul Yocto Project, consultare il sito web di Yocto Project all'indirizzo del :yocto_home:`Sito Web di Yocto Project <>`. Per creare un'immagine senza alcuna conoscenza di Yocto Project per testarlo rapidamente, consultare il documento :doc:`/brief-yoctoprojectqs/index`. Per un elenco completo di link e altra documentazione, consultare la sezione ":ref:`Links and Related Documentation <resources-links-and-related-documentation>`" nel Manuale di Riferimento di Yocto Project.

source: Before building the documentation PDF, setup the ``PATH`` to use the installed packages (with ``${textooldir}`` pointing to the TeX Live installation from the previous step):
it_it: Prima di creare la documentazione in PDF, impostare la variabile d'ambiente ``PATH`` per utilizzare i pacchetti installati (con ``${textooldir}`` che punta all'installazione di TeX Live del passaggio precedente):

source: Before looking at BSP requirements, you should consider the following:
it_it: Prima di esaminare i requisiti per i BSP, è opportuno considerare quanto segue:

source: Before looking at the recommended form for the directory structure inside a BSP layer, you should be aware that there are some requirements in order for a BSP layer to be considered compliant with the Yocto Project. For that list of requirements, see the ":ref:`bsp-manual/bsp:released bsp requirements`" section.
it_it: Prima di esaminare la struttura di directory consigliata all'interno di un layer BSP, è bene sapere che esistono alcuni requisiti affinché un layer BSP sia considerato conforme a Yocto Project. Per l'elenco di tali requisiti, consultare la sezione ":ref:`bsp-manual/bsp:released bsp requirements`".

source: Before presenting the contents of each file, here are the steps that we need to follow to accomplish what we want in the first place, which is integrating ``sayhello`` in our root file system:
it_it: Prima di presentare il contenuto di ciascun file, ecco i passaggi da seguire per raggiungere il nostro obiettivo, ovvero integrare ``sayhello`` nel nostro file system principale:

source: Before reading further, make sure you've taken a look at the :yocto_home:`Technical Overview</development/technical-overview>` page which presents the definitions for many of the terms referenced here. Also, know that some of the information here won't make sense now, but as you start developing, it is the information you'll want to keep close at hand. These are best known methods for working with Yocto Project and they are updated regularly.
it_it: Prima di procedere con la lettura, si raccomanda di consultare la pagina :yocto_home:`Technical Overview</development/technical-overview>` la quale contiene le definizioni di molti dei termini qui menzionati. Inoltre, è importante considerare che alcune informazioni potrebbero non risultare chiare nell'immediato ma, con l'inizio dello sviluppo, rappresenteranno i dettagli da tenere maggiormente a portata di mano. Queste costituiscono le migliori pratiche per l'utilizzo di Yocto Project e vengono aggiornate regolarmente.

source: Before running the ``send-pull-request`` script, you must edit the cover letter patch to insert information about your change. After editing the cover letter, send the pull request. For example, the following command runs the script and specifies the patch directory and email address. In this example, the email address is a mailing list::
it_it: Prima di eseguire lo script ``send-pull-request``, è necessario modificare la patch della lettera di presentazione per inserire le informazioni sulla modifica. Dopo aver modificato la lettera di presentazione, si invia la pull request. Ad esempio, il seguente comando esegue lo script e specifica la directory della patch e l'indirizzo email. In questo esempio, l'indirizzo email è quello di una mailing list::

source: Before submitting any change, you need to be sure who the maintainer is or what mailing list that you need to notify. Use either these methods to find out:
it_it: Prima di inviare qualsiasi modifica, ci si deve accertare di chi sia il manutentore o a quale mailing list inviare la notifica. Utilizzare uno di questi metodi per scoprirlo:

source: Before we do that, however, let's try running a different profile, one which shows something a little more interesting. The only difference between the new profile and the previous one is that we'll add the ``-g`` option, which will record not just the address of a sampled function, but the entire call chain to the sampled function as well::
it_it: Prima di procedere, però, proviamo a eseguire un profilo diverso, uno che mostri qualcosa di un po' più interessante. L'unica differenza tra il nuovo profilo e il precedente è l'aggiunta dell'opzione ``-g``, che registrerà non solo l'indirizzo di una funzione campionata, ma anche l'intera catena di chiamate a quella funzione::

source: Before you can use Toaster, you need to first set up your build system to run the Yocto Project. To do this, follow the instructions in the ":ref:`dev-manual/start:preparing the build host`" section of the Yocto Project Development Tasks Manual. For Ubuntu/Debian, you might also need to do an additional install of pip3. ::
it_it: Prima di poter utilizzare Toaster, è necessario configurare il sistema di build per eseguire Yocto Project. Per fare ciò, seguire le istruzioni nella sezione ":ref:`dev-manual/start:preparing the build host`" del Manuale di Sviluppo dei Task di Yocto Project. Per Ubuntu/Debian, potrebbe essere necessario installare anche pip3. ::

source: Before you use remote Toaster monitoring, you should do a health check. To do this, ping the Toaster server using the following call to see if it is still alive::
it_it: Prima di utilizzare il monitoraggio remoto di Toaster, è consigliabile eseguire una verifica dello stato di salute. Per farlo, si esegue un ping al server Toaster utilizzando la seguente chiamata per verificare se è ancora attivo::

source: Behind the scenes, the shared state code works by looking in :term:`SSTATE_DIR` and :term:`SSTATE_MIRRORS` for shared state files. Here is an example::
it_it: Dietro le quinte, il codice dello stato condiviso funziona cercando i file di stato condiviso in :term:`SSTATE_DIR` e :term:`SSTATE_MIRRORS`. Ecco un esempio::

source: Below is a comprehensive list of target architectures and features that are supported, as well as their level of support. For each architecture or feature, their corresponding builders are also listed.
it_it: Di seguito è riportato un elenco completo delle architetture target e delle funzionalità supportate, nonché il relativo livello di supporto. Per ogni architettura o funzionalità, sono elencati anche i relativi sviluppatori.

source: Below is a list of primary tested features, their maintainer(s) and builder(s):
it_it: Di seguito è riportato un elenco delle funzionalità principali testate, con i relativi manutentori e sviluppatori:

source: Below is a list of secondary tested features, their maintainer(s) and builder(s):
it_it: Di seguito è riportato un elenco delle funzionalità secondarie testate, con i relativi manutentori e sviluppatori:

source: Below is an example of the Raspberry Pi BSP layer that is available from the :yocto_git:`Source Repositories <>`:
it_it: Di seguito è riportato un esempio del layer BSP per Raspberry Pi disponibile nei :yocto_git:`Source Repositories <>`:

source: Below is the typical directory structure for a BSP layer. While this basic form represents the standard, realize that the actual layout for individual BSPs could differ. ::
it_it: Di seguito è riportata la struttura di directory tipica per un layer BSP. Sebbene questa struttura di base rappresenti lo standard, è importante tenere presente che il layout effettivo dei singoli BSP potrebbe differire. ::

source: BitBake Tasks Map
it_it: Mappa dei Task di BitBake

source: BitBake Tool
it_it: Il Tool BitBake

source: BitBake User Manual
it_it: Manuale Utente di BitBake

source: BitBake also tries to execute any dependent tasks first. So for example, before building ``matchbox-desktop``, BitBake would build a cross compiler and ``glibc`` if they had not already been built.
it_it: BitBake tenta inoltre di eseguire prima tutti i task dipendenti. Ad esempio, prima di compilare ``matchbox-desktop``, BitBake compilerebbe un cross-compilatore e ``glibc`` se non fossero già stati compilati.

source: BitBake creates this directory if it does not exist. As a last resort, to clean up a build and start it from scratch (other than the downloads), you can remove everything in the ``tmp`` directory or get rid of the directory completely. If you do, you should also completely remove the ``build/sstate-cache`` directory.
it_it: BitBake crea questa directory se non esiste. Come ultima risorsa, per ripulire una build e riavviarla da zero (esclusi i download), è possibile rimuovere tutto il contenuto della directory ``tmp`` o eliminarla completamente. In tal caso, è necessario rimuovere completamente anche la directory ``build/sstate-cache``.

source: BitBake finds and applies multiple patches for a single recipe in the order in which it locates the patches. The :term:`FILESPATH` variable defines the default set of directories that the build system uses to search for patch files. Once found, patches are applied to the recipe's source files, which are located in the :term:`S` directory.
it_it: BitBake individua e applica più patch per una singola ricetta nell'ordine in cui le individua. La variabile :term:`FILESPATH` definisce l'insieme predefinito di directory che il sistema di build utilizza per cercare i file di patch. Una volta individuate, le patch vengono applicate ai file sorgente della ricetta, che si trovano nella directory :term:`S`.

source: BitBake handles the parsing and execution of the data files. The data itself is of various types:
it_it: BitBake gestisce l'analisi e l'esecuzione dei file di dati. I dati stessi sono di vario tipo:

source: BitBake is a generic task execution engine that allows shell and Python tasks to be run efficiently and in parallel while working within complex inter-task dependency constraints. In short, BitBake is a build engine that works through recipes written in a specific format in order to perform sets of tasks.
it_it: BitBake è un motore generico per l'esecuzione di task che consente di eseguire in modo efficiente e parallelo task di shell e Python, gestendo al contempo complesse dipendenze tra i task. In breve, BitBake è un motore di build che funziona tramite ricette scritte in un formato specifico per eseguire insiemi di task.

source: BitBake is a task scheduler and execution engine that parses instructions (i.e. recipes) and configuration data. After a parsing phase, BitBake creates a dependency tree to order the compilation, schedules the compilation of the included code, and finally executes the building of the specified custom Linux image (distribution). BitBake is similar to the ``make`` tool.
it_it: BitBake è un gestore di task e un motore di esecuzione che analizza le istruzioni (ovvero le ricette) e i dati di configurazione. Dopo una fase di analisi, BitBake crea un albero delle dipendenze per ordinare la compilazione, pianifica la compilazione del codice incluso e infine esegue la creazione dell'immagine Linux personalizzata specificata (distribuzione). BitBake è simile al tool ``make``.

source: BitBake is the tool at the heart of the :term:`OpenEmbedded Build System` and is responsible for parsing the :term:`Metadata`, generating a list of tasks from it, and then executing those tasks.
it_it: BitBake è lo strumento centrale di :term:`OpenEmbedded Build System` e si occupa di analizzare i :term:`Metadata`, generare un elenco di attività [task] e quindi eseguirle.

source: BitBake knows how to combine multiple data sources together and refers to each data source as a layer. For information on layers, see the ":ref:`dev-manual/layers:understanding and creating layers`" section of the Yocto Project Development Tasks Manual.
it_it: BitBake sa come combinare più fonti di dati e si riferisce a ciascuna fonte di dati come a un livello (layer). Per informazioni sui layer, consultare la sezione ":ref:`dev-manual/layers:understanding and creating layers`" del Manuale di Sviluppo dei Task di Yocto Project.

source: BitBake needs some basic configuration files in order to complete a build. These files are ``*.conf`` files. The minimally necessary ones reside as example files in the ``conf`` subdirectory of the :term:`Build Directory`.
it_it: BitBake necessita di alcuni file di configurazione di base per completare una build. Questi file sono file ``*.conf``. Quelli minimi necessari si trovano come file di esempio nella sottocartella ``conf`` della :term:`Build Directory`.

source: BitBake uses the :ref:`do_package_write_* <ref-tasks-package_write_deb>` tasks to generate packages and place them into the package holding area (e.g. ``do_package_write_ipk`` for IPK packages). See the ":ref:`ref-tasks-package_write_deb`", ":ref:`ref-tasks-package_write_ipk`", and ":ref:`ref-tasks-package_write_rpm`" sections in the Yocto Project Reference Manual for additional information. As an example, consider a scenario where an IPK packaging manager is being used and there is package architecture support for both i586 and qemux86. Packages for the i586 architecture are placed in ``build/tmp/deploy/ipk/i586``, while packages for the qemux86 architecture are placed in ``build/tmp/deploy/ipk/qemux86``.
it_it: BitBake utilizza i task :ref:`do_package_write_* <ref-tasks-package_write_deb>` per generare pacchetti e posizionarli nell'area di gestione dei pacchetti (ad esempio, ``do_package_write_ipk`` per i pacchetti IPK). Per ulteriori informazioni, consultare le sezioni ":ref:`ref-tasks-package_write_deb`", ":ref:`ref-tasks-package_write_ipk`" e ":ref:`ref-tasks-package_write_rpm`" nel Manuale di Riferimento di Yocto Project. Ad esempio, si consideri uno scenario in cui viene utilizzato un gestore di pacchetti IPK e sono disponibili architetture di pacchetti sia per i586 che per qemux86. I pacchetti per l'architettura i586 vengono posizionati in ``build/tmp/deploy/ipk/i586``, mentre i pacchetti per l'architettura qemux86 vengono posizionati in ``build/tmp/deploy/ipk/qemux86``.

source: BitBake uses the :ref:`structure-build-conf-bblayers.conf` file, which is part of the user configuration, to find what layers it should be using as part of the build.
it_it: BitBake utilizza il file :ref:`structure-build-conf-bblayers.conf`, che fa parte della configurazione utente, per individuare i layer da utilizzare durante la compilazione.

source: BitBake uses the :term:`SRC_URI` variable to point to source files regardless of their location. Each recipe must have a :term:`SRC_URI` variable that points to the source.
it_it: BitBake utilizza la variabile :term:`SRC_URI` per indicare la posizione dei file sorgente, indipendentemente dalla loro ubicazione. Ogni ricetta deve avere una variabile :term:`SRC_URI` che punta al codice sorgente.

source: BitBake was originally a part of the OpenEmbedded project. It was inspired by the Portage package management system used by the Gentoo Linux distribution. In 2004, the OpenEmbedded project was split the project into two distinct pieces:
it_it: BitBake era originariamente parte del progetto OpenEmbedded. Si ispirava al sistema di gestione dei pacchetti Portage utilizzato dalla distribuzione Gentoo Linux. Nel 2004, il progetto OpenEmbedded fu suddiviso in due parti distinte:

source: BitBake, a generic task executor
it_it: BitBake, un esecutore di task generico

source: Board Support Package (BSP) Manual
it_it: Manuale del Board Support Package (BSP)

source: Both Yocto Project and OpenEmbedded have many key components that are maintained by patches being submitted on mailing lists. We appreciate this approach does look a little old fashioned when other workflows are available through web technology such as GitHub, GitLab and others. Since we are often asked this question, we've decided to document the reasons for using mailing lists.
it_it: Sia Yocto Project che OpenEmbedded hanno molti componenti chiave che vengono mantenuti tramite patch inviate tramite mailing list. Sappiamo che questo approccio può sembrare un po' antiquato, considerando che sono disponibili altri flussi di lavoro basati su tecnologie web come GitHub, GitLab e altri. Poiché ci viene spesso posta questa domanda, abbiamo deciso di documentare i motivi per cui utilizziamo le mailing list.

source: Both native and cross packages run on the build host. However, cross packages generate output for the target architecture.
it_it: Sia i pacchetti nativi che quelli cross-locabili vengono eseguiti sull'host di compilazione. Tuttavia, i pacchetti cross-locabili generano output per l'architettura target.

source: Branches maintained with security fixes
it_it: Branch mantenuti con correzioni di sicurezza

source: Browse images, recipes, and machines provided by those layers.
it_it: Esplorare immagini, ricette e macchine fornite da tali layer.

source: Browse layers listed in the various :ref:`layer sources <toaster-manual/reference:layer source>` that are available in your project (e.g. the OpenEmbedded Layer Index at :oe_layerindex:`/`).
it_it: Esplorare i layer elencati nelle varie :ref:`sorgenti di layer <toaster-manual/reference:layer source>` disponibili nel progetto (ad esempio, l'indice dei layer OpenEmbedded all'indirizzo :oe_layerindex:`/`).

source: Browse published layers in the :oe_layerindex:`OpenEmbedded Layer Index <>` that are available for your selected version of the build system.
it_it: Esplorare i layer pubblicati nell':oe_layerindex:`OpenEmbedded Layer Index <>` disponibili per la versione del sistema di build selezionata.

source: Browse the directory structure of your image.
it_it: Esplorare la struttura delle directory dell'immagine.

source: Build - compile and link
it_it: Build - compilazione e collegamento (linking)

source: Build Host Packages
it_it: Pacchetti dell'Host di Build

source: Build Process Security
it_it: Sicurezza del Processo di Build

source: Build an ``-sdk`` version of the image e.g.::
it_it: Crea una versione ``-sdk`` dell'immagine, ad esempio::

source: Build class specific variables such as :term:`EXTRA_OECONF`
it_it: variabili specifiche per la classe di build come :term:`EXTRA_OECONF`

source: Build tools in binary form, providing required versions of development tools (such as Git, GCC, Python and make), to run the OpenEmbedded build system on a development host without such minimum versions.
it_it: Tool di compilazione in formato binario, che forniscono le versioni necessarie degli strumenti di sviluppo (come Git, GCC, Python e make) per eseguire il sistema di build di OpenEmbedded su un host di sviluppo che non dispone di tali versioni minime.

source: Builder(s)
it_it: Builder

source: Building Your Image
it_it: Building dell'Immagine

source: Building Your Own ``buildtools`` Tarball
it_it: Building del Proprio Archivio tar di ``buildtools``

source: Building a Specific Recipe Given Multiple Versions
it_it: Building di una Ricetta Specifica con più Versioni

source: Building an image from scratch is both an advantage and a disadvantage to the process. As mentioned in the previous paragraph, building from scratch ensures that everything is current and starts from a known state. However, building from scratch also takes much longer as it generally means rebuilding things that do not necessarily need to be rebuilt.
it_it: La compilazione di un'immagine da zero presenta sia un vantaggio che uno svantaggio. Come accennato nel paragrafo precedente, la compilazione da zero garantisce che tutto sia aggiornato e parta da uno stato noto. Tuttavia, la compilazione da zero richiede anche molto più tempo, poiché generalmente implica la ricompilazione di elementi che non necessariamente necessitano di essere ricompilati.
